In [2]:
import pandas as pd

In [8]:
import pandas as pd
data={"NAME":{"SRC","Rateesh","Kalpayan"},"Age":{20,21,19},"Marks":[90,95,85]}
ds=pd.Series(data)
print(ds)

NAME     {Kalpayan, SRC, Rateesh}
Age                  {19, 20, 21}
Marks                [90, 95, 85]
dtype: object

In [11]:
import pandas as pod
Lord_SRC=[10,100,20,200]
Lord_Rateesh=[20,200,30,300]
Lord_Kalpayan=[30,300,40,400]
in1=[0,1,2,3]
in2=["a","b","c","d"]
ds=pod.Series(Lord_SRC,index=in1,name="Lord_SRC")
dw=pod.Series(Lord_Rateesh,index=in2,name="Lord_Rateesh")
print(ds)
print(dw)

0     10
1    100
2     20
3    200
Name: Lord_SRC, dtype: int64
a     20
b    200
c     30
d    300
Name: Lord_Rateesh, dtype: int64

In [29]:
import pandas as pd
import numpy as np
metro=["Virat","Rohit","Ravindra"]
tc=["kohli","Sharma","Jadeja"]
s=[1,2,3]
rt=pd.Series(tc,index=metro,name="Cricketers")
print(rt)

Virat        kohli
Rohit       Sharma
Ravindra    Jadeja
Name: Cricketers, dtype: object

In [31]:
##Dataframe(2d array like structure)
import pandas as pd
data={"Name":["Virat","Rohit","Ravindra"],"Age":[30,35,32],"Country":["India","India","India"]}
df=pd.DataFrame(data)   
print(df)

       Name  Age Country
0     Virat   30   India
1     Rohit   35   India
2  Ravindra   32   India

In [33]:
##Create a DataFrame from a list of dictionaries
import pandas as pod
data=[
    {"Name":"Virat","Age":30,"Country":"India"},
    {"Name":"Rohit","Age":35,"Country":"India"},        
    {"Name":"Ravindra","Age":32,"Country":"India"}
]
dr=pod.DataFrame(data)
print(dr)

       Name  Age Country
0     Virat   30   India
1     Rohit   35   India
2  Ravindra   32   India

In [40]:
import pandas as pd
df=pd.read_csv("sales_data.csv")

print(df.tail(5))

     Transaction ID        Date Product Category  \
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

In [43]:
data

[{'Name': 'Virat', 'Age': 30, 'Country': 'India'},
 {'Name': 'Rohit', 'Age': 35, 'Country': 'India'},
 {'Name': 'Ravindra', 'Age': 32, 'Country': 'India'}]

In [ ]:
dr

       Name  Age Country
0     Virat   30   India
1     Rohit   35   India
2  Ravindra   32   India

In [7]:
import pandas as pd
data = {"Name": ["Virat", "Rohit", "Ravindra"],
        "Age": [30, 35, 32],
        "IPL teams": ["RCB", "MI", "CSK"]}
de=pd.DataFrame(data)
print(de)

       Name  Age IPL teams
0     Virat   30       RCB
1     Rohit   35        MI
2  Ravindra   32       CSK

In [20]:
de.iloc[0,2]="GT"
print(de)

       Name  Age IPL teams
0     Virat   30        GT
1     Rohit   35        MI
2  Ravindra   32       CSK

In [21]:
##Accesing a sp element using at and iat
de

       Name  Age IPL teams
0     Virat   30        GT
1     Rohit   35        MI
2  Ravindra   32       CSK

In [31]:
de.iat[1,0]

'Rohit'

In [32]:
##Data Manipulation with DataFrame
de

       Name  Age IPL teams
0     Virat   30        GT
1     Rohit   35        MI
2  Ravindra   32       CSK

In [42]:
de.iat[2,2]

'CSK'

In [43]:
de["Salary"]=[10000,20000,40000]
de

       Name  Age IPL teams  Salary
0     Virat   30        GT   10000
1     Rohit   35        MI   20000
2  Ravindra   32       CSK   40000

In [77]:
de["Name"]=["Virat Kohli","Rohit Sharma","Ravindra Jadeja"]
de
de["Age"]=de["Age"]+10
de

   Age IPL teams             Name
0  300        GT      Virat Kohli
1  305        MI     Rohit Sharma
2  302       CSK  Ravindra Jadeja

In [79]:
import pandas as pd
data = {"Name": ["Virat", "Rohit", "Ravindra"],
        "Age": [30, 35, 32],
        "IPL teams": ["RCB", "MI", "CSK"]}
de=pd.DataFrame(data)
print(de)

       Name  Age IPL teams
0     Virat   30       RCB
1     Rohit   35        MI
2  Ravindra   32       CSK

In [1]:
de

NameError: name 'de' is not defined

In [ ]:
dw.corr()